package alexenko.server;

/**
 * Enum класс, реализующий интерфейс клиентского меню.
 */
enum ClientMenu {

    /**
     * Интерфейс меню для клиентов, которые только что подключились.
     */
    NEW_CLIENT(
            "****************************************\n" +
                    "******* Добро пожаловать в чат:) *******\n" +
                    "****************************************\n" +
                    "|--------------------------------------|\n" +
                    "|1| Зарегистрироваться в чате          |\n" +
                    "|--------------------------------------|\n" +
                    "|999| Выйти из приложения              |\n" +
                    "|--------------------------------------|\n", "1"),

    /**
     * Интерфейс меню для клиентов, которые проходят регистрацию.
     */
    REGISTRATION_PROCESS(
            "****************************************\n" +
                    "*** Регистрация нового пользователя! ***\n" +
                    "****************************************\n" +
                    "|--------------------------------------|\n" +
                    "| Введите ваше имя                     |\n" +
                    "|--------------------------------------|\n", "1"),

    /**
     * Интерфейс меню для клиентов, которые прошли регистрацию в чате.
     */
    REGISTERED_CLIENT(
            "****************************************\n" +
                    "************* Главное меню *************\n" +
                    "****************************************\n" +
                    "|--------------------------------------|\n" +
                    "|1| Начать общение                     |\n" +
                    "|--------------------------------------|\n" +
                    "|999| Выйти из приложения              |\n" +
                    "|--------------------------------------|", "1"),

    /**
     * Интерфейс меню для клиентов, которые зашли в чат.
     */
    CHAT(
            "******************************\n" +
                    "********** ФУНКЦИИ ***********\n" +
                    "******************************\n" +
                    "|----------------------------|\n" +
                    "|1| Список клиентов онлайн   |\n" +
                    "|----------------------------|\n" +
                    "|999| Выйти из чата          |\n" +
                    "|----------------------------|\n" +
                    "******************************\n" +
                    "***** ОТПРАВКА СООБЩЕНИЯ *****\n" +
                    "******************************\n" +
                    "|----------------------------|\n" +
                    "|ИМЯ_ПОЛУЧАТЕЛЯ:СООБЩЕНИЕ    |\n" +
                    "|----------------------------|", "1");

    /**
     * Интерфейс клиентского меню.
     */
    private final String message;

    /**
     * Пункт один клиентского меню.
     */
    private final String pointOne;

    /**
     * Пункт выход.
     */
    private static final String exit = "999";

    /**
     * Конструктор, инициализирующий интерфейс клиентского меню.
     *
     * @param message интерфейс клиентского меню
     */
    ClientMenu(String message, String pointOne) {
        this.message = message;
        this.pointOne = pointOne;
    }

    /**
     * Получить интерфейс клиентского меню.
     *
     * @return интерфейс клиентского меню
     */
    public String getMessage() {
        return this.message;
    }

    /**
     * Метод возвращает первый пункт клиентского меню.
     *
     * @return первый пункт интерфейса пользователя
     */
    public String getPointOne() {
        return pointOne;
    }

    /**
     * Метод возвращает пункт выход клиентского меню.
     *
     * @return первый пункт интерфейса пользователя
     */
    public static String getExit() {
        return exit;
    }
}
